In [879]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [880]:
df = pd.read_csv("census1.csv")

In [881]:
#Summary of Data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8002 entries, 0 to 8001
Data columns (total 12 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Unnamed: 0                     8002 non-null   int64
 1   House Number                   7962 non-null   float64
 2   Street                         7962 non-null   object
 3   First Name                     7962 non-null   object
 4   Surname                        7962 non-null   object
 5   Age                            7962 non-null   object
 6   Relationship to Head of House  7376 non-null   object
 7   Marital Status                 6169 non-null   object
 8   Gender                         7962 non-null   object
 9   Occupation                     7962 non-null   object
 10  Infirmity                      60 non-null     object
 11  Religion                       3510 non-null   object
dtypes: float64(1), int64(1), object(10)
memory usage: 750.3+ KB

In [882]:
df.head()

,Unnamed: 0,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
0,0,1.0,Johnson Glens,Kyle,Smith,20,Head,Single,Male,University Student,NaN,Christian
1,1,2.0,Johnson Glens,Gregory,Davies,26,Head,Single,Male,Theme park manager,NaN,NaN
2,2,3.0,Johnson Glens,Ian,Hawkins,66,Head,Widowed,Male,Osteopath,NaN,NaN
3,3,4.0,Johnson Glens,Kevin,Barton,21,Head,Single,Male,University Student,NaN,NaN
4,4,4.0,NaN,Sophie,Parsons,33,NaN,Single,Female,Adult nurse,NaN,NaN

In [883]:
# Missing Values in each Column
df.isnull().sum()

Unnamed: 0                          0
House Number                       40
Street                             40
First Name                         40
Surname                            40
Age                                40
Relationship to Head of House     626
Marital Status                   1833
Gender                             40
Occupation                         40
Infirmity                        7942
Religion                         4492
dtype: int64

### House Number

In [884]:
df["House Number"].unique()

array([  1.,   2.,   3.,   4.,   5.,   6.,   7.,   8.,   9.,  10.,  11.,
        12.,  13.,  14.,  15.,  16.,  17.,  18.,  19.,  20.,  21.,  22.,
        23.,  24.,  nan,  26.,  27.,  28.,  29.,  30.,  31.,  32.,  33.,
        34.,  35.,  36.,  37.,  38.,  39.,  40.,  41.,  42.,  43.,  44.,
        45.,  46.,  47.,  48.,  49.,  50.,  25.,  51.,  52.,  53.,  54.,
        55.,  56.,  57.,  58.,  59.,  60.,  61.,  62.,  63.,  64.,  65.,
        66.,  67.,  68.,  69.,  70.,  71.,  72.,  73.,  74.,  75.,  76.,
        77.,  78.,  79.,  80.,  81.,  82.,  83.,  84.,  85.,  86.,  87.,
        88.,  89.,  90.,  91.,  92.,  93.,  94.,  95.,  96.,  97.,  98.,
        99., 100., 101., 102., 103., 104., 105., 106., 107., 108., 109.,
       110., 111., 112., 113., 114., 115., 116., 117., 118., 119., 120.,
       121., 122., 123., 124., 125., 126., 127., 128., 129., 130., 131.,
       132., 133., 134., 135., 136., 137., 138., 139., 140., 141., 142.,
       143., 144., 145., 146., 147., 148., 149., 150., 151., 152., 153.,
       154., 155., 156., 157., 158., 159., 160., 161., 162., 163., 164.,
       165., 166., 167., 168., 169., 170., 171., 172., 173., 174., 175.,
       176., 177., 178., 179., 180., 181., 182., 183., 184., 185., 186.,
       187., 188., 189., 190., 191., 192., 193., 194., 195., 196., 197.,
       198., 199., 200., 201., 202., 203., 204., 205., 206., 207., 208.,
       209., 210., 211., 212., 213., 214., 215., 216., 217., 219., 220.,
       221., 222., 223., 224., 225., 226., 227., 228., 229., 230., 231.])

In [885]:
print("NaN Values in House Number: ",df["House Number"].isnull().sum())

NaN Values in House Number:  40

In [886]:
df.loc[df['House Number'].isnull(), 'First Name']

42          Chloe
255        Dennis
256         Paige
820        Hayley
1406        Bruce
1875        Sally
1879        Bryan
1929         Luke
1959        Abbie
2091         Neil
2182       Donald
2224      Bradley
2227      Russell
2664    Alexander
2958        Bruce
3179     Patricia
3202        Jason
3676       Judith
3804     Patricia
3873      Terence
3896      Annette
3997      Stanley
4071         Luke
4486       Hilary
4675       Martyn
5152        Brian
5461    Alexandra
5495      Deborah
5784       George
5996        Janet
6042        Colin
6178         Emma
6225      Anthony
6295    Elizabeth
6366    Christian
6607          Ann
6788       Joanne
7176       Dennis
7352       Ronald
7996       Amelia
Name: First Name, dtype: object

In [887]:
# Define the function to fill House Number
def fill_house_number(row, lookup_df, index):
    if pd.isna(row['House Number']):
        # Find rows in lookup_df with the same Street and Surname and a non-missing House Number
        match = lookup_df[(lookup_df['Street'] == row['Street']) & 
                          (lookup_df['Surname'] == row['Surname']) & 
                          ~pd.isna(lookup_df['House Number'])]
        if not match.empty:  # If a match is found
            return match['House Number'].iloc[0]  # Return the first matched House Number
        else:  # If no match is found, use the next House Number of the previous row
            if index > 0:  # Ensure it's not the first row
                previous_house_number = lookup_df['House Number'].shift(1).iloc[index]+1
                return previous_house_number
    return row['House Number']  # If House Number is not missing, return it as is

# Apply the function to fill missing House Numbers
df['House Number'] = df.apply(lambda row: fill_house_number(row, df, row.name), axis=1)

In [888]:
print("NaN Values in House Number: ",df["House Number"].isnull().sum())

NaN Values in House Number:  0

### Street

In [889]:
df["Street"].unique()

array(['Johnson Glens', nan, 'Albert Avenue', 'Hodgson Vista',
       'Wilkinson Place', 'Horseshoe Lane', 'Guardian Lane',
       'Russell Street', 'Anvil Avenue', 'Music Drive', 'Lancelot Avenue',
       'Lomond Road', 'Wakefieldtap Road', 'Myers Road',
       'Minsterhatch Street', 'St.Johnbelt Avenue', 'January Drive',
       'Ebor Lane', 'Laurel Street', 'Howard Drive', 'King Knolls',
       'Thomas Brooks', 'Wallace Mission', 'Thomas Extensions',
       'Brookes Avenue', 'Read Lane', 'Eastertooth Road',
       'Whittaker Avenue', 'Institution Place', 'Guardian Via',
       'Ash Squares', 'Powell Street', 'Sagittarius Road',
       'Liverpool Orchard', 'Brady Port', 'Exetercurl Lane',
       'Windsor Road', 'Castor Lane', 'South Crossing', 'Dockers Drive',
       'Manchester Mews', 'Lightning Street', 'Martin Lake', 'Henge Road',
       'Aries Drive', 'Steel Ramp', 'Dragons Highway', 'Mercia Trace',
       'Gough Street', 'Bolton Hills', 'Trawler Knoll', 'Patel Drive',
       'Lancelot Motorway', 'Charity Ferry', "O'Brien Drive",
       'Panther Terrace', 'Davies Road', 'Cook Street',
       'Southampton Terrace', 'Mistletoe Hollow', 'Gregory Estate',
       'Ring Drive', 'Yates Avenue', 'Lion Mount', 'Grant Road',
       'Wright Ridges', 'Mason Motorway', 'Douglas Views',
       'Gwynedddike Avenue', 'Badger Street', 'Cottingham Drive',
       'Lobstermix Street', 'Williams Rue', 'Canary Avenue',
       'Jones Trail', 'Parkinson Mountain', 'London Street',
       'Boyle Wells', 'Sims Crest', 'Foster Avenue',
       'Scepterbranch Avenue', 'Robinson Spring', 'Coniferpath Road',
       'Elephant Drive', 'Wilkinson Views', 'Beaver Pine',
       'Metropolispath Avenue', 'Brighton Avenue', 'St.Matthew Forges',
       'Bastille Avenue', 'Dublin Avenue', 'Canary Manor', 'Bishop House',
       'Bradley Granary', 'Scepter Longhouse', 'Albion Cabin',
       'Sandy Obervatory', 'Beech Chalet', 'Windermere Warehouse',
       'Knight Abbey', 'Fox Tower', 'Tamarisk Citadel', 'Morton Barracks',
       'Ali Castle', 'St.Matthew Delve', 'Sydney Hall'], dtype=object)

In [890]:
# Define the function to fill Street
def fill_Street(row, lookup_df, index):
    if pd.isna(row['Street']):
        # Find rows in lookup_df with the same House Number and Surname and a non-missing House Number
        match = lookup_df[(lookup_df['House Number'] == row['House Number']) & 
                          (lookup_df['Surname'] == row['Surname']) & 
                          ~pd.isna(lookup_df['Street'])]
        if not match.empty:  # If a match is found
            return match['Street'].iloc[0]  # Return the first matched Street
        else:  # If no match is found, use the Street Name of the previous row
            if index > 0:  # Ensure it's not the first row
                previous_Street = lookup_df['Street'].shift(1).iloc[index]
                return previous_Street
    return row['Street']  # If Street is not missing, return it as is

# Apply the function to fill missing Street
df['Street'] = df.apply(lambda row: fill_Street(row, df, row.name), axis=1)

In [891]:
print("NaN Values in Street: ",df["Street"].isnull().sum())

NaN Values in Street:  0

### First Name

In [902]:
presentable = df["First Name"].unique()
a = [i for i in presentable]
print(a)

['Kyle', 'Gregory', 'Ian', 'Kevin', 'Sophie', 'Pauline', 'Iain', 'Jenna', 'Carly', 'Neil', 'Tina', 'Martin', 'Katherine', 'Terence', 'Leigh', 'Gavin', 'Jill', 'Brett', 'Denise', 'Jane', 'Jennifer', 'Trevor', 'Matthew', 'Olivia', 'Paul', 'Donald', 'Lisa', 'John', 'Marie', 'Marc', 'Jasmine', 'Hazel', 'Mary', 'Katy', 'Victoria', 'Abdul', 'Craig', 'Karen', 'Angela', 'George', 'Heather', 'Chloe', 'Joanna', 'Joseph', 'Elliot', 'Vincent', 'Diana', 'William', 'Jodie', 'Shannon', 'Joshua', 'Julian', 'Christine', 'Harriet', 'Rosie', 'Adrian', 'Luke', 'Reece', 'Kieran', 'Gail', 'Dawn', 'Hayley', 'Barry', 'Dale', 'Howard', 'Bethan', 'Danielle', 'Deborah', 'Rosemary', 'Robin', 'Ruth', 'Graeme', 'Jacob', 'Jeffrey', 'Leslie', 'Zoe', 'Hollie', 'Stewart', 'Janet', 'Garry', 'Eric', 'Kathleen', 'Sharon', 'Kenneth', 'Roger', 'Stacey', 'Eleanor', 'Sally', 'Robert', 'Debra', 'Claire', 'Tracey', 'Terry', 'Kelly', 'Grace', 'Jonathan', 'Mohammed', 'Cheryl', 'Malcolm', 'Thomas', 'Gillian', 'Harry', 'Lindsey', 'Joel', nan, 'Ben', 'Nicole', 'Nicola', 'Patricia', 'Raymond', 'Jayne', 'Gareth', 'Beth', 'Donna', 'Josephine', 'Stephen', 'Dorothy', 'Maria', 'Phillip', 'Liam', 'Rhys', 'Frederick', 'Leanne', 'Sam', 'David', 'Leonard', 'Mitchell', 'Alexander', 'Owen', 'Catherine', 'Lauren', 'Anthony', 'Elaine', 'Ricky', 'Stephanie', 'Guy', 'Wayne', 'Sandra', 'Amy', 'Teresa', 'Carol', 'Danny', 'Margaret', 'Melissa', 'Katie', 'Shirley', 'Mark', 'Max', 'Molly', 'Abbie', 'Kimberley', 'Antony', 'Philip', 'Conor', 'Connor', 'Alice', 'Gemma', 'Lucy', 'Shaun', 'Leah', 'Adam', 'Peter', 'Joan', 'Frank', 'Ronald', 'Albert', 'Paula', 'Charles', 'Fiona', 'Brenda', 'Damien', 'Sylvia', 'Martyn', 'Ellie', 'Diane', 'Nathan', 'Kathryn', 'Rachel', 'Susan', 'Joe', 'Judith', 'Eileen', 'Alex', 'Sheila', 'Carolyn', 'Lewis', 'Mathew', 'Anna', 'Anne', 'Justin', 'Oliver', 'Dean', 'Frances', 'Andrea', 'Dennis', 'Paige', 'Jade', 'Natasha', 'Lawrence', 'Samantha', 'Marion', 'Scott', 'Jacqueline', 'Simon', 'Jean', 'Mohammad', 'Sarah', 'Darren', 'Yvonne', 'Ryan', 'Caroline', 'Clive', 'Amanda', 'Timothy', 'Jordan', 'Naomi', 'Colin', 'Laura', 'Arthur', 'Sian', 'Gordon', 'Gary', 'Tracy', 'Charlene', 'Melanie', 'Janice', 'Bryan', 'Billy', 'Francis', 'Marian', 'Lynda', 'Glenn', 'Christian', 'Georgina', 'Jessica', 'Elliott', 'Sean', 'Derek', 'Mohamed', 'Emma', 'Sara', 'James', 'Kayleigh', 'Carole', 'Rachael', 'Clifford', 'Joanne', 'Steven', 'Shane', 'Russell', 'Vanessa', 'Benjamin', 'Lee', 'Julia', 'Damian', 'Kirsty', 'Irene', 'Stuart', 'Charlotte', 'Hugh', 'June', 'Daniel', 'Geraldine', 'Toby', 'Christopher', 'Jay', 'Lorraine', 'Brian', 'Chelsea', 'Tony', 'Victor', 'Nicholas', 'Ann', 'Wendy', 'Dominic', 'Alison', 'Rita', 'Marilyn', 'Natalie', 'Gerald', 'Clare', 'Emily', 'Louise', 'Amelia', 'Leon', 'Karl', 'Allan', 'Edward', 'Duncan', 'Michelle', 'Valerie', 'Gerard', 'Geoffrey', 'Norman', 'Josh', 'Stanley', 'Dylan', 'Bruce', 'Michael', 'Ashley', 'Charlie', 'Holly', 'Kim', 'Jamie', 'Jake', 'Bethany', 'Aaron', 'Hilary', 'Lesley', 'Joyce', 'Lynn', 'Pamela', 'Jemma', 'Graham', 'Ross', 'Mandy', 'Jack', 'Abigail', 'Roy', 'Francesca', 'Louis', 'Kerry', 'Georgia', 'Jason', 'Douglas', 'Kate', 'Henry', 'Suzanne', 'Nigel', 'Maureen', 'Elizabeth', 'Bernard', 'Denis', 'Beverley', 'Callum', 'Tom', 'Julie', 'Ashleigh', 'Barbara', 'Cameron', 'Maurice', 'Rebecca', 'Keith', 'Carl', 'Jeremy', 'Megan', 'Lynne', 'Amber', 'Andrew', 'Hannah', 'Alan', 'Linda', 'Patrick', 'Lydia', 'Richard', 'Glen', 'Brandon', 'Aimee', 'Alexandra', 'Helen', 'Marcus', 'Samuel', 'Bradley', 'Declan', 'Annette']

In [805]:
df['First Name'] = df['First Name'].fillna(df["First Name"].mode()[0])

In [806]:
print("NaN Values in First Name: ",df["First Name"].isna().sum())

NaN Values in First Name:  0

### Surname

In [908]:
df.loc[df['Surname'].isnull(), 'First Name']

45        Elliot
98        Claire
219     Kathleen
220        Frank
232        Susan
250       Oliver
702      Francis
747       Donald
965        Julie
1405       Brian
1426       Roger
1453     Elliott
1576        Iain
2234      Marian
2249     Rebecca
2502     Russell
2510       Janet
2635      Edward
2845      Yvonne
2906      Graeme
3060         Lee
3096       Emily
3870       Garry
3932     Vanessa
4160       Paula
4363      Stuart
4484       Harry
4735         Guy
4822        Leah
4913       Roger
5438        Owen
5691      Joanne
6104     Frances
6944        Kate
7026      Sylvia
7415      Teresa
7458        Ryan
7477        Leah
7725        Lisa
7852    Clifford
Name: First Name, dtype: object

In [909]:
df["Surname"].unique()

array(['Smith', 'Davies', 'Hawkins', 'Barton', 'Parsons', 'Marsden',
       'Hutchinson', 'Cox', 'Barrett', 'Lees', 'Davis-Lees', 'Sanderson',
       'Giles-Sanderson', 'Leach', 'Moore', 'Nicholson', 'Jordan',
       'Lawrence', 'Gray', 'Poole', 'Frost', 'Baker', 'Thomas',
       'Campbell', 'Henry', 'Hughes', 'Booth', 'Wright', nan, 'Roberts',
       'Harris', 'Kent', 'Bennett', 'Goodwin', 'Sims', 'Armstrong',
       'Austin', 'Adams', 'Jones', 'Scott', 'Berry', 'Kay', 'Edwards',
       'Hardy', 'Kennedy', 'Bishop', 'Chandler', 'Green', 'Joyce',
       'McCarthy', 'Ashton', 'Carr', 'Richardson', 'Russell', 'Collins',
       'Richards', 'Rogers', 'Rogers-Stokes', 'Gill', 'Whittaker',
       'Turner', 'Holloway', 'McDonald', 'Stevenson', 'Duncan', 'Butler',
       'Singh', 'Hayward', 'Buckley', 'Taylor-Gregory', 'Wilkinson',
       'Payne', 'Fletcher', 'Wood', 'Andrews', 'Davis', 'Powell',
       'Spencer', 'Lewis', 'Webb', 'Potter', 'Williams', 'Middleton',
       'Nash', 'Bull', 'Akhtar', 'Ball', 'Clarke', 'Griffiths', 'Bowen',
       'Dyer', 'Brown', 'Evans', 'Grant', 'Goddard', 'Carroll', 'Allen',
       'Brookes', 'Thornton', 'Griffin', 'Holland', 'Wall', 'Page',
       'Martin', 'Johnson', 'Watkins', 'French', 'Naylor', 'Preston',
       'Quinn', 'Norman', 'Bolton', 'Gregory', 'Wilson', 'Hudson',
       'Simpson-Rowe', 'Metcalfe', 'Haynes', 'Kirby', 'Holt', 'Lord',
       'Begum', 'Donnelly-Begum', 'White', 'Rice', 'Glover', 'Gibson',
       'Carter', 'Woodward', 'Cook', 'Taylor', 'Mills', 'Gibbs', 'North',
       'Glover-Davies', 'Sinclair', 'Knight', 'Vaughan', 'Patel', 'Riley',
       'Alexander', 'Palmer', 'Young', 'Daniels', 'Ali', 'Newton',
       'Morley', 'Wong', 'Dunn', 'Hodgson', 'Briggs', 'Ward', 'Walsh',
       'Swift', 'Gardner', 'Davison', 'Hurst', 'Butcher', 'Gallagher',
       'Warner', 'Fisher', 'Fitzgerald', "O'Neill", 'Walker', 'Parry',
       'West', 'James', 'Robertson', 'Gilbert-Evans', 'Hale',
       'Robertson-Davis', 'Simpson', 'Holden', 'Atkins', 'Talbot-Atkins',
       'Ellis', 'Khan', 'Law-Smith', 'Fuller', 'Bailey', 'Morgan',
       'Shepherd', 'Atkinson', 'Dean', 'Burton', 'Barker', 'Cooper',
       'Francis', 'Robinson', 'Barlow', 'Brooks', 'Armstrong-Brooks',
       'Miller', 'Cole', 'Smart', 'Franklin', 'Lambert', 'Ferguson',
       'Chapman', 'Dale', 'Skinner', 'Randall', 'Hyde', 'Watson',
       'Townsend', 'Sheppard', 'Parkin', 'Fry', 'Andrews-Griffiths',
       'Bird', 'Parker', 'Long', 'Heath', 'Curtis', 'Wheeler', 'Boyle',
       'Thompson', 'Connolly', 'Hancock', 'Saunders', 'Owens', 'Clements',
       'Riley-Thorpe', 'Humphreys-Riley-Thorpe', 'King', 'Clayton',
       'Ahmed', 'Morris', 'Hayes', 'Howarth', 'Reynolds', ' ', 'Lloyd',
       'Watson-Hodgson', 'Newman', 'Gordon', 'Roberts-Edwards', 'Walton',
       'Hopkins', 'Dennis', 'Jackson', 'Harvey', 'Freeman', 'Fleming',
       'Dickinson', 'Lee', 'Brennan', 'Thompson-Brennan', 'Rhodes',
       'Rose', 'Jarvis', 'Holmes', 'Gray-Stevenson', 'Leonard',
       'Farmer-Leonard', 'Cole-Dunn', 'Power-Brookes', 'Manning',
       'Harrison', 'Willis', 'Howard', 'Bell', 'Potts', 'Whitehouse',
       'Wilkins', 'John', 'Hall', 'May', 'Bruce', 'Norton', 'Sharpe',
       'Nicholls', 'Chambers', 'Marshall', 'Morrison', 'Macdonald',
       'Ryan', 'Bentley', 'Archer', 'Cross', 'Mann', 'Dixon', 'Ford',
       'Coles', 'Benson-Bennett', 'Murray', 'Hanson', 'Perry', 'Hunt',
       'Williams-Lloyd', 'Bond', 'Higgins', 'Pope', 'Kerr', 'Tomlinson',
       'Flynn', 'Elliott', 'George', 'Woodward-George', 'Jenkins',
       'Hargreaves', 'Oliver', 'Shah', 'Davies-Wright', 'Warren',
       'Hartley', 'Hussain', 'Franklin-Woodward', 'Byrne', 'Pearson',
       'Collins-Taylor', 'Morton', 'Chan-Young', 'Phillips', 'Wallace',
       'Dobson', 'Greenwood', 'Read', 'Stokes', 'McLean', 'Stephenson',
       'Norris', 'Webster', 'Walters', 'Hilton', 'Bradley', 'Charlton',
       'Woods', 'Hunter', 'Blake', 'Foster', 'Hart', 'Black',
       'Davidson-Green', 'Dawson', 'Bevan-Cole', 'Gardiner', "O'Brien",
       'Hill', 'Welch', 'Lawson', 'Wade', 'Shaw', 'Mason-Smith', 'Hope',
       'Arnold', 'Morris-Arnold', 'Lamb', 'Jennings', 'Humphreys', 'Rees',
       'Miles', 'Miles-White', 'Cooke', 'Gibbons', 'Hamilton', 'Moss',
       'Morris-Stevenson', 'Sullivan', 'Lane', 'Farmer', 'Davey',
       'Conway', 'Mason', 'Anderson', 'Kay-Thomas', 'Pritchard', 'Price',
       'Allan', 'Bates', 'Owen', 'Douglas', 'Banks', 'Ashton-Bruce',
       'Osborne', 'Webster-Holloway', 'Davidson', 'Pratt', "O'Connor",
       'Cunningham', 'Moran', 'Stewart', 'Stevens', 'Stone', 'Tucker',
       'Bevan', 'Day', 'Kelly', 'Howells', 'Harding', 'Fox', 'Sutton',
       'Giles', 'Waters', 'Knowles', 'Donnelly', 'Clark', 'Matthews',
       'Gould', 'Horton', 'Burgess', 'Stephens', 'Todd', 'Doyle',
       'Murphy', 'Burrows', 'Daly', 'Pollard', 'Law', 'Watts',
       'Patterson', 'Simmons', 'Schofield', 'Bryant', 'Graham', 'Kirk',
       'Burns', 'Ross', 'Barnes', 'Lyons', 'King-Anderson', 'McKenzie',
       'Gilbert', 'Pearce', 'Hooper', 'Miah', 'Kemp', 'Clark-Campbell',
       'Brady', 'Nelson', 'Godfrey', 'Chamberlain', 'Barber', 'Thomson',
       'Griffiths-Kerr', 'Harper', 'Foster-Kelly', 'Kirk-Walton',
       'Barnett', 'Page-Carroll', 'Rowe', 'Duffy', 'Whitehead', 'Bibi',
       'Hammond', 'Fowler', 'Blackburn', 'Talbot', 'Mitchell', 'Mistry',
       'Bray', 'Burns-Hargreaves', 'Pickering', 'Bradley-Wells',
       'Cameron', 'Reed', 'Crawford', 'Davison-Leach', 'Mellor',
       'Rogers-Allen', 'Williams-Harding', 'Clayton-Scott', "O'Sullivan",
       'Nolan', 'Thompson-Bray', 'Peters', 'Coleman', 'Stanley-Williams',
       'Garner-Potts', 'Barry', 'Hobbs', 'Davey-Hurst', 'Tyler', 'Fraser',
       'Benson', 'Bartlett', 'Bryan', 'Weston', 'Short',
       'Clarke-Robinson', 'Thorpe', 'Mahmood', 'Finch', 'Hammond-Davis',
       'Ellis-Brennan', 'Hewitt', 'Collier', 'Forster', 'Howe', 'Steele',
       'Lowe', 'Humphries', 'Henderson', 'Hudson-Henderson', 'Marsh',
       'Dunn-Green', 'Abbott', 'Thomas-Hill', 'Parkinson', 'Farrell',
       'Patel-Donnelly', 'Johnson-Evans', 'Herbert', 'Chan', 'Savage',
       'Howell', 'Robson', 'Williams-Savage', 'Nixon', 'Williamson',
       'Field', 'Wells', 'Cartwright', 'Noble', 'Parkes', 'Lowe-Nolan',
       'Turnbull', 'Carpenter', 'Hall-Davies', 'Wallis', 'Butler-Wade',
       'Baxter', 'Rowley', 'Ford-Foster', 'Price-Simpson', 'Sanders',
       'Bradshaw', 'Porter', 'Hall-Simpson', 'Perkins', 'Lucas', 'Slater',
       'Iqbal', 'Little', 'Whittaker-Reeves', 'Lynch', 'Brennan-Singh',
       'Law-Brennan-Singh', 'Black-King', 'Storey', 'Khan-Byrne', 'Burke',
       'Peacock', 'Reid', 'Dodd', 'Johnston', 'Matthews-Jackson',
       'Connor', 'Barber-Smith', 'Douglas-Hobbs', 'Reeves', 'Jones-Green',
       'Wells-Wilkinson', 'Kaur', 'Rahman', 'Holmes-Whitehead', 'Pugh',
       'King-Fisher', 'Hicks', 'Evans-Stewart', 'Ali-Allen', 'Browne',
       'Berry-Evans', 'Hargreaves-Ellis', 'Baldwin', 'Sykes',
       'Wilson-Wilson', 'Robson-Watson', 'Webster-Shaw', 'Coates',
       'Moore-Fisher', 'James-Atkinson', 'Stokes-Glover', 'Tucker-Clark',
       'Doherty', 'Hill-Davies', 'Thompson-Hill-Davies',
       'Morris-Thompson-Hill-Davies', 'Winter', 'Craig', 'Taylor-Price',
       'Clark-Byrne', 'Kennedy-Hudson', 'Jackson-Cox', 'Anderson-Harvey',
       'Evans-Perry', 'Sims-Jones', 'Yates', 'Jenkins-Williams',
       'Evans-Reed', 'Power', 'Pearson-Thompson', 'Nash-Begum', 'Stanley',
       'Summers', 'Williams-McCarthy', 'Smith-Fowler', 'Hill-Campbell',
       'Lloyd-Harrison', 'Townsend-McCarthy', 'Hill-Walton',
       'Harris-Phillips', 'Smith-Graham', 'Myers', 'Holmes-Hughes',
       'Brooks-Simpson', 'Roberts-Smith', 'Robinson-Perry', 'Carey',
       'Sharp', 'Ahmed-Godfrey', 'Williams-Burgess', 'Morris-Harrison',
       'Porter-Smith', 'Berry-Smith', 'Patel-Humphries',
       'Gardiner-Simpson', 'Webb-Mellor', 'Bull-Roberts',
       'Riley-Bull-Roberts', 'Roberts-Dawson', 'Wright-Edwards', 'Garner',
       'Coleman-Walker', 'Howells-McCarthy', 'Smith-Moran',
       'Rogers-Anderson', 'King-Carr', 'Ingram', 'Palmer-Davies',
       'Green-King', 'Allan-Allen', 'Bowen-Carter', 'Cooke-Briggs',
       'Vincent', 'Rhodes-Williams', 'Moore-Barrett', 'Faulkner',
       'Connolly-Smith', 'Gough', 'Hayes-May', 'Wyatt', 'Stokes-Brown',
       'Abbott-Bishop', 'Birch', 'Chapman-Woods', 'Butcher-Mills',
       'Harrison-Robinson', 'Chadwick', 'Briggs-Jackson', 'Hughes-Taylor'],
      dtype=object)

In [910]:
# Define the function to fill Surname
def fill_Surname(row, lookup_df):
    if pd.isna(row['Surname']):
        # Find rows in lookup_df with the same House Number and Street and a non-missing Surname
        match = lookup_df[(lookup_df['House Number'] == row['House Number']) & 
                          (lookup_df['Street'] == row['Street']) & 
                          ~pd.isna(lookup_df['Surname'])]
        if not match.empty:  # If a match is found
            return match['Surname'].iloc[0]  # Return the first matched Surname
        else:
            # Replace rest NaN values with the mode of the Surname column
            return lookup_df['Surname'].mode()[0]
    return row['Surname']  # If Surname is not missing, return it as is

# Apply the function to fill missing Surname
df['Surname'] = df.apply(lambda row: fill_Surname(row, df), axis=1)

In [911]:
print("NaN Values in Surname: ",df["Surname"].isna().sum())

NaN Values in Surname:  0

In [912]:
df.loc[97:99]

,Unnamed: 0,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
97,97,4.0,Albert Avenue,Debra,Turner,37,Head,Divorced,Female,Unemployed,NaN,NaN
98,98,4.0,Albert Avenue,Claire,Turner,1,Daughter,NaN,Female,Child,NaN,NaN
99,99,4.0,Albert Avenue,Sally,Holloway,40,Lodger,Single,Female,"Geologist, wellsite",NaN,Sikh

In [811]:
df.loc[45, 'Surname']

'Smith'

### Age

In [812]:
df["Age"].unique()

array(['20', '26', '66', '21', '33', '36', '84', '65', '63', '31', '42',
       '51', '17', '69', '40', '39', '58', '61', '37', '67', '68', '72',
       '71', '43', '88', '27', '29', '5', '62', '80', '19', '23', '28',
       '45', '73', '24', '57', '30', '34', '1', '56', '18', '85', '41',
       '14', '35', '38', '54', '83', '8', '76', '78', '44', '53', '22',
       '64', '75', '82', '46', '60', nan, '11', '25', '4', '7', '6', '81',
       '59', '50', '47', '3', '52', '91', '89', '9', '2', '32', '49',
       '13', '70', '77', '10', '79', '16', '90', '0', '55', '15', '92',
       '48', '74', '86', '12', '93', '99', '95', '105', '94', '87', '101',
       '97', '62.83041769675679', '58.83041769675679', '96',
       '47.71556193215697', '103', '106', '89.87416264746113',
       '38.00000000000001', 'three', 'two', '58.63373334760486', '104',
       '102', '170', '98', 'eight', '100'], dtype=object)

In [813]:
df.loc[df['Age'].isnull(), 'First Name']

116         John
427         Jade
659         Anna
1172       Debra
1242        Tina
1273      Leslie
1398       Julie
1421      Howard
1455      Lauren
1467      Jordan
1886       Jemma
2000       Kerry
2527      Damien
2621      Sharon
2744     Russell
3016         Sam
3131      Damien
3314      Gordon
3756     Anthony
4349      Alison
4704     Patrick
4737      Judith
4931       Naomi
4980        Lisa
5019       Barry
5093       Jamie
5327      Hollie
5684      Hilary
5767      Daniel
6095       Lynda
6590        Glen
6592       Terry
6696    Jennifer
6887        Neil
7390      Olivia
7711       Fiona
7840       Ricky
7984         Zoe
7989       Louis
7994       Derek
Name: First Name, dtype: object

In [814]:
#Replacing Categorical Values into int
df['Age'] = df['Age'].replace('three', 3)
df['Age'] = df['Age'].replace('two', 2)
df['Age'] = df['Age'].replace('eight', 8)

In [815]:
df[df["Age"] == "170"]

,Unnamed: 0,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
6622,6622,25.0,London Street,Mohammed,Scott,170,Grandson,NaN,male,Student,NaN,NaN

In [816]:
Age_mode = df.loc[(df["Relationship to Head of House"] == "Grandson") & (df["Occupation"] == "Student"),"Age"].mode()[0]
df['Age'] = df['Age'].replace("170", Age_mode)

In [817]:
#Float to int
df["Age"] = pd.to_numeric(df["Age"] ,errors = "coerce")

In [819]:
# Define the function to Fill Age
def fill_Age(row, lookup_df):
    if pd.isna(row['Age']):
        if row["Occupation"] == "Student" :
            return lookup_df.loc[lookup_df["Occupation"] == "Student", 'Age'].median()
        else:
            return lookup_df.loc[lookup_df["Age"] > 18, "Age"].median()
    return row['Age']  # If Surname is not missing, return it as is

# Apply the function to fill missing Age
df['Age'] = df.apply(lambda row: fill_Age(row, df), axis=1)

In [821]:
print("NaN Values in Age: ",df["Age"].isna().sum())

NaN Values in Age:  0

### Relationship to Head of House

In [737]:
df[df["Relationship to Head of House"].isna()]

,Unnamed: 0,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
4,4,4.0,Johnson Glens,Sophie,Parsons,33.0,NaN,Single,Female,Adult nurse,NaN,NaN
5,5,4.0,Johnson Glens,Pauline,Marsden,36.0,NaN,Single,Female,Risk analyst,NaN,Sikh
6,6,5.0,Johnson Glens,Iain,Hutchinson,84.0,NaN,Widowed,Male,Retired Manufacturing engineer,NaN,Muslim
37,37,23.0,Johnson Glens,Craig,Hughes,20.0,NaN,Married,Male,University Student,NaN,Christian
57,57,33.0,Johnson Glens,Adrian,Armstrong,21.0,NaN,Single,Male,University Student,NaN,Catholic
...,...,...,...,...,...,...,...,...,...,...,...,...
7953,7953,1.0,Windermere Warehouse,Dawn,Taylor,18.0,NaN,Divorced,Female,Student,NaN,NaN
7954,7954,1.0,Windermere Warehouse,Christine,Thompson,62.0,NaN,Single,Female,"Scientist, physiological",NaN,Christian
7955,7955,1.0,Windermere Warehouse,Sally,Brown,63.0,NaN,Single,Female,"Teacher, special educational needs",NaN,Christian
7956,7956,1.0,Windermere Warehouse,Leah,Chadwick,36.0,NaN,Single,Female,Sports therapist,NaN,Catholic
7957,7957,1.0,Windermere Warehouse,Sara,Wright,54.0,NaN,Single,Female,Television production assistant,NaN,NaN

In [822]:
df.loc[(df["Age"]>=18) & (df["Relationship to Head of House"].isna()),"Relationship to Head of House"] = "Head"
df.loc[(df["Age"]<18) & (df["Relationship to Head of House"].isna() & (df["Gender"] == "Male")),"Relationship to Head of House"] = "Son"
df.loc[(df["Age"]<18) & (df["Relationship to Head of House"].isna() & (df["Gender"] == "Female")),"Relationship to Head of House"] = "Daughter"

In [823]:
print("NaN Values in Relationship to Head of House: ",df["Relationship to Head of House"].isna().sum())

NaN Values in Relationship to Head of House:  1

In [824]:
df[df["Relationship to Head of House"].isna()]

,Unnamed: 0,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
7157,7157,1.0,Robinson Spring,Brandon,Brooks,3.0,NaN,NaN,NaN,Child,NaN,NaN

In [825]:
df.loc[7157,"Relationship to Head of House"] = "Son"

In [826]:
print("NaN Values in Relationship to Head of House: ",df["Relationship to Head of House"].isna().sum())

NaN Values in Relationship to Head of House:  0

### Marital Status

In [827]:
df["Marital Status"].unique()

array(['Single', 'Widowed', 'Divorced', 'Married', nan], dtype=object)

In [828]:
df.loc[df["Age"]<18,"Marital Status"] = "Single"

In [829]:
print("NaN Values in Marital Status: ",df["Marital Status"].isna().sum())

NaN Values in Marital Status:  32

In [830]:
df.loc[df["Relationship to Head of House"] == "Wife","Marital Status"] = "Married"
df.loc[df["Relationship to Head of House"] == "Husband","Marital Status"] = "Married"

In [831]:
print("NaN Values in Marital Status: ",df["Marital Status"].isna().sum())

NaN Values in Marital Status:  25

In [832]:
df["Marital Status"] = df["Marital Status"].fillna("Single")

In [833]:
print("NaN Values in Marital Status: ",df["Marital Status"].isna().sum())

NaN Values in Marital Status:  0

### Gender

In [834]:
df["Gender"].unique()

array(['Male', 'Female', 'm', 'male', 'F', 'f', nan, 'female', 'M', ' '],
      dtype=object)

In [835]:
#Replacing all entries into Male/Female Format
df['Gender'] = df['Gender'].replace('m', "Male")
df['Gender'] = df['Gender'].replace('male', "Male")
df['Gender'] = df['Gender'].replace('F', "Female")
df['Gender'] = df['Gender'].replace('f', "Female")
df['Gender'] = df['Gender'].replace('female', "Female")
df['Gender'] = df['Gender'].replace('M', "Male")

In [836]:
df[df["Gender"] == " "]

,Unnamed: 0,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
4533,4533,24.0,Bolton Hills,Valerie,Baker,4.0,Daughter,Single,,Child,NaN,NaN

In [837]:
df['Gender'] = df['Gender'].replace(" ", "Female")

In [838]:
# Mapping dictionary for Relationship to Gender
Relationship_to_gender = {"Son":"Male",
                          "Husband":"Male",
                          "Daughter":"Female",
                          "Wife":"Female",
                          "Grandson":"Male",
                          "Granddaughter":"Female",
                          "Adopted Daughter":"Female",
                          "Step-Son":"Male",
                          "Step-Daughter":"Female",
                          "Adopted Son":"Male",
                          "Daughter-in-law":"Female",
                          "Adopted Grandson":"Male",
                          "Nephew":"Male",
                          "Niece":"Female"}

#Replacing NaN value in gender accordingly with relationship to head of house
df['Gender'] = df['Gender'].fillna(df['Relationship to Head of House'].map(Relationship_to_gender))

In [839]:
print("NaN Values in Gender: ",df["Gender"].isna().sum())

NaN Values in Gender:  20

In [840]:
df[df["Gender"].isna()]

,Unnamed: 0,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
148,148,24.0,Albert Avenue,Alexander,Ball,81.0,Head,Divorced,NaN,Retired Copy,NaN,Christian
1207,1207,18.0,Music Drive,Bryan,Nicholson,74.0,Head,Widowed,NaN,Retired Chief Technology Officer,NaN,Christian
1507,1507,27.0,St.Johnbelt Avenue,Dylan,Howells,18.0,Head,Widowed,NaN,Student,NaN,NaN
2356,2356,11.0,Thomas Extensions,Annette,Rogers,31.0,Head,Single,NaN,Unemployed,NaN,Catholic
2387,2387,16.0,Thomas Extensions,Laura,Mitchell,24.0,Head,Single,NaN,"Teacher, adult education",NaN,Muslim
2651,2651,8.0,Eastertooth Road,Joan,Bell,85.0,Head,Divorced,NaN,Retired Conference centre manager,NaN,Catholic
2857,2857,152.0,Eastertooth Road,Paige,Jones,77.0,Head,Widowed,NaN,Retired Wellsite geologist,NaN,NaN
3107,3107,8.0,Sagittarius Road,John,Harris,40.0,Head,Single,NaN,Community pharmacist,NaN,Catholic
3263,3263,4.0,Brady Port,Denise,Carpenter,20.0,Head,Single,NaN,University Student,NaN,NaN
3456,3456,7.0,Dockers Drive,Gareth,Read,56.0,Head,Single,NaN,Warehouse manager,NaN,NaN
3923,3923,37.0,Aries Drive,Anthony,Fraser,45.0,Visitor,Widowed,NaN,Educational psychologist,NaN,Catholic
4155,4155,10.0,Dragons Highway,Susan,Robinson,78.0,Head,Divorced,NaN,Unemployed,NaN,Methodist
4271,4271,28.0,Dragons Highway,Janet,Dawson,41.0,Head,Single,NaN,Architectural technologist,NaN,Christian
4752,4752,82.0,Trawler Knoll,Bethany,Hughes,88.0,Head,Widowed,NaN,Retired Heritage manager,NaN,Christian
6306,6306,13.0,Williams Rue,Bethany,Bowen,56.0,Head,Single,NaN,Astronomer,NaN,Christian
6877,6877,17.0,Foster Avenue,Chelsea,Murray,30.0,Head,Married,NaN,Scientific laboratory technician,NaN,NaN
7076,7076,6.0,Scepterbranch Avenue,Lucy,Wallis,29.0,Head,Single,NaN,Musician,NaN,NaN
7567,7567,58.0,Wilkinson Views,Shane,Ellis,25.0,Head,Single,NaN,"Psychologist, occupational",NaN,NaN
7874,7874,31.0,Dublin Avenue,Peter,Byrne,57.0,Partner,Single,NaN,Financial manager,NaN,NaN
7899,7899,40.0,Dublin Avenue,Susan,Ward,59.0,Head,Married,NaN,Mechanical engineer,NaN,Christian

In [841]:
df["Gender"] = df["Gender"].fillna("Undeclared")

In [842]:
print("NaN Values in Gender: ",df["Gender"].isna().sum())

NaN Values in Gender:  0

### Occupation

In [843]:
print("Minimum Age for Child in Data:",df.loc[df["Occupation"] == "Child","Age"].min())
print("Maximum Age for Child in Data:",df.loc[df["Occupation"] == "Child","Age"].max())

Minimum Age for Child in Data: 0.0
Maximum Age for Child in Data: 4.0

In [844]:
print("Minimum Age for Student in Data:",df.loc[df["Occupation"] == "Student","Age"].min())
print("Maximum Age for Student in Data:",df.loc[df["Occupation"] == "Student","Age"].max())

Minimum Age for Student in Data: 5.0
Maximum Age for Student in Data: 18.0

In [845]:
df.loc[(df["Age"]<18) & (df["Relationship to Head of House"].isna() & (df["Gender"] == "Female")),"Relationship to Head of House"] = "Daughter"

In [846]:
df.loc[(df["Age"] >= 0) & (df["Age"] <= 4),"Occupation"] = "Child"
df.loc[(df["Age"] >= 5) & (df["Age"] <= 18),"Occupation"] = "Student"
df.loc[(df["Age"] >= 68) & (df["Age"] <= 106),"Occupation"] = "Retired"

In [847]:
print("NaN Values in Occupation: ",df["Occupation"].isna().sum())

NaN Values in Occupation:  28

In [848]:
possible_occupations = df["Occupation"].unique()
random_occupations = np.random.choice(possible_occupations, size=len(df))
print(random_occupations)
df['Occupation'] = df['Occupation'].fillna(pd.Series(random_occupations))

['Programmer, applications' 'Warehouse manager' 'Insurance risk surveyor'
 ... 'Surveyor, insurance' 'Engineer, maintenance' 'Arts administrator']

In [849]:
print("NaN Values in Occupation: ",df["Occupation"].isna().sum())

NaN Values in Occupation:  0

### Infirmity

In [850]:
df["Infirmity"].unique()

array([nan, 'Unknown Infection', 'Physical Disability', 'Deaf',
       'Disabled', 'Mental Disability', 'Blind', ' '], dtype=object)

In [851]:
#Replacing NaN values with None
df['Infirmity'] = df['Infirmity'].fillna("None")
#Replacing blank entries with None
df['Infirmity'] = df['Infirmity'].replace(' ', "None")

In [852]:
print("NaN Values in Infirmity: ",df["Infirmity"].isnull().sum())

NaN Values in Infirmity:  0

### Religion

In [853]:
df["Religion"].unique()

array(['Christian', nan, 'Sikh', 'Muslim', 'Catholic', 'Methodist',
       'Jewish', 'Housekeeper', 'Baptist', 'Hindu', 'Sith', 'Private',
       'Nope', 'Agnostic'], dtype=object)

In [854]:
df["Religion"] = df["Religion"].replace("Nope","Atheist")
mode = df["Religion"].mode()[0]
df["Religion"] = df["Religion"].replace("Housekeeper",mode)
df["Religion"] = df["Religion"].replace("Private",mode)

In [855]:
print("NaN Values in Religion: ",df["Religion"].isnull().sum())

NaN Values in Religion:  4492

In [856]:
df[
            ((df['Street'] == df['Street']) &
            (df['House Number'] == df['House Number']) &
            (df['Surname'] == df['Surname']) &
            ~pd.isna(df['Religion']))
        ]

,Unnamed: 0,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
0,0,1.0,Johnson Glens,Kyle,Smith,20.0,Head,Single,Male,University Student,None,Christian
5,5,4.0,Johnson Glens,Pauline,Marsden,36.0,Head,Single,Female,Risk analyst,None,Sikh
6,6,5.0,Johnson Glens,Iain,Hutchinson,84.0,Head,Widowed,Male,Retired,None,Muslim
7,7,6.0,Johnson Glens,Jenna,Cox,65.0,Head,Widowed,Female,Meteorologist,None,Christian
8,8,7.0,Johnson Glens,Carly,Barrett,63.0,Head,Divorced,Female,Theme park manager,None,Christian
...,...,...,...,...,...,...,...,...,...,...,...,...
7989,7989,1.0,St.Matthew Delve,Louis,Carpenter,44.0,Son,Single,Male,Fine artist,None,Christian
7993,7993,1.0,St.Matthew Delve,Joanne,Carpenter,21.0,Daughter,Single,Female,University Student,None,Christian
7996,7996,1.0,Sydney Hall,Amelia,Taylor,35.0,Head,Married,Female,Warehouse manager,None,Methodist
7997,7997,1.0,Sydney Hall,Marc,Taylor,34.0,Husband,Married,Male,Claims inspector/assessor,None,Methodist
8001,8001,1.0,Sydney Hall,Jenna,Barker,33.0,Lodger,Single,Female,"Nurse, learning disability",None,Catholic

In [858]:
df["Religion"].isna().sum()

4492

In [859]:
# Define the function to fill Religion
def fill_Religion(row, lookup_df):
    if pd.isna(row['Religion']):
        # Filter rows in lookup_df with the same Street, House Number, and Surname
        matches = lookup_df[(lookup_df['Street'] == row['Street']) & 
                            (lookup_df['House Number'] == row['House Number']) & 
                            (lookup_df['Surname'] == row['Surname']) & 
                            ~pd.isna(lookup_df['Religion'])]
        # Check if any matches are found
        if not matches.empty:
            # Return the first matched Religion
            return matches['Religion'].iloc[0]
        else:
            # If no match is found, use Atheist
            return "Atheist"
    
    # If Religion is not missing, return it as is
    return row['Religion']

# Apply the function to fill missing Religions
df['Religion'] = df.apply(lambda row: fill_Religion(row, df), axis=1)

In [860]:
df["Religion"].isna().sum()

0